# SizeLookupTableIsNotAvailableForType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..SizeLookupTableIsNotAvailableForType Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Size Lookup Table is not available for type [Family Symbol].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SizeLookupTableIsNotAvailableForType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SizeLookupTableIsNotAvailableForType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SizeLookupTableIsNotAvailableForType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace